Revit 2024 API
FabricationHostedInfo.HostId Property
 Returns the identifier of the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId HostId { get; }
Visual Basic
Public ReadOnly Property HostId As ElementId
	Get
Visual C++
public:
property ElementId^ HostId {
	ElementId^ get ();
}
See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace